/* Заполняем таблицы музыкального сервиса... */
/* Добавить жанры: */
INSERT INTO genres (genre_name)
VALUES ('поп-музыка'),
       ('рок-музыка'),
	   ('авторская музыка');

/* Добавить исполнителей: */
INSERT INTO performers (nickname)
VALUES ('Тальков'),
       ('Nautilus Pompilius'),
       ('Высоцкий'),
       ('Вячеслав бутусов');

/* Добавить альбомы: */
INSERT INTO albums (album_name, year_of_release)
VALUES ('Я вернусь', 1993),
       ('Этот мир', 2019),
       ('Родина моя', 2001),
       ('Князь тишины', 1989),
       ('Титаник', 1994),
       ('Овалы', 2020);

/* Добавить треки: */
INSERT INTO tracks (track_name, duration, album_id)
VALUES ('Глобус', '00:06:54', 1),
       ('Метаморфоза', '00:03:39', 1),
       ('Война', '00:03:51', 1),
       ('Люди с забинтованными лбами', '00:06:21', 1),
       ('Я вернусь', '00:06:11', 1),
       ('Фатальная колесница', '00:06:20', 2),
       ('В океане непонимания', '00:04:34', 2),
       ('Мой мир', '00:04:26', 2),
       ('Дядя', '00:05:07', 3),
       ('Бал сатаны', '00:04:54', 3),
       ('Господин президент', '00:03:46', 3),
       ('Родина моя', '00:04:20', 3),
       ('Скованные', '00:04:23', 4),
       ('Князь тишины', '00:03:37', 4),
       ('Шар цвета хаки', '00:02:40', 4),
       ('Титаник', '00:04:56', 5),
       ('Тутанхамон', '00:04:47', 5),
       ('Песня о друге', '00:02:51', 6),
       ('Вершина', '00:02:38', 6),
       ('Корабли', '00:02:55', 6),
       ('My star', '00:04:05', 6);

/* Добавить сборники: */
INSERT INTO collections (collection_name, year_of_creation)
VALUES ('Россия', 1991),
       ('Этот мир', 1993),
       ('Легенды русского рока', 2019);

/* Добавить жанры-исполнителей: */
INSERT INTO genres_of_performers (genre_id, performer_id)
VALUES (1, 1),
       (1, 3),
       (2, 1),
       (2, 2),
       (2, 4),
       (3, 1),
       (3, 3);

/* Добавить альбомы-исполнителей: */
INSERT INTO albums_by_performers (album_id, performer_id)
VALUES (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (4, 2),
       (4, 4),
       (5, 2),
       (5, 4),
       (6, 1),
       (6, 3),
       (6, 4);

/* Добавить сборники-треков: */
INSERT INTO collections_of_tracks (collection_id, track_id)
VALUES (1, 1),
       (1, 2),
       (1, 4),
       (1, 5),
       (1, 11),
       (1, 16),
	   (2, 6),
	   (2, 8),
	   (2, 11),
	   (2, 10),
	   (2, 12),
	   (3, 13),
	   (3, 14),
	   (3, 15),
	   (3, 16),
	   (3, 17);
 